package test008.java;

public class HomeWork05 {

}


/*
 * 函数：方法基本概念
 * 1.函数的作用
 * a.函数能够将数据运算完得到一个结果
 * b.函数能够减少重复代码
 * c.函数可以让程序的逻辑更清晰，当定义好一个函数，
 * 需要用它的时候，可以直接调用，不用再管内部的运算过程
 * 2.函数的定义
 *   访问修饰符  其他修饰符  返回值类型 方法名/函数名  (参数列表) throw 异常 {
 *   方法体/函数体
 *return 返回值；
 * }  
 * 
 * 访问修饰符：public private protected default(不写为默认)
 * public  公共的，都可以访问
 * private  私有的， 当前类结构能够使用
 * protected  受保护的  同包能使用，不同包不能使用，可以继承
 * default  默认类型   同包能使用，不同包不能使用
 * 
 * 其他功能修饰符
 * abstract 抽象类，没有具体意义，一般是为了让有继承关系让子类重写
 * 所修饰的类叫抽象类
 * 所修饰的方法叫抽象方法
 * 
 * finala  最终修饰符
 * 常量命名为大写字母
 * 修饰方法时，方法不能被重写
 * 修饰类是，类不能被集成，不可扩展
 * 
 * 
 * static  静态访问修饰符
 * 可以修饰任何结构
 * 修饰方法：静态方法
 *修饰变量：静态变量
 *
 *只能修饰类结构中的成员结构
 *
 *修饰类【内部类、成员内部类】
 * 不能修饰构造函数
 * 
 * 静态结构，可以直接调用静态结构
 * 静态结构，不可以直接调用非静态结构
 * 
 * 非静态结构，可以调用非静态结构
 * 非静态结构，可以调用静态结构
 * 
 * 总结为：静态只能调用静态，非静态都能调用（静态/ 非静态）
 * 
 * 
 * 
 * */


